In [1]:
import pandas as pd

In [2]:


data = {
    "EmpID":[101,102,103,104,105],
    "Name":["Alice","Bob","Charlie","David","Emma"],
    "Age":[25,30,28,35,26],
    "Dept":["HR","IT","Finance","IT","HR"],
    "Salary":[55000,72000,68000,88000,60000],
    "Experience":[1,4,3,8,2]
}

df = pd.DataFrame(data)

print(df)

   EmpID     Name  Age     Dept  Salary  Experience
0    101    Alice   25       HR   55000           1
1    102      Bob   30       IT   72000           4
2    103  Charlie   28  Finance   68000           3
3    104    David   35       IT   88000           8
4    105     Emma   26       HR   60000           2

In [3]:
df.head(3)

   EmpID     Name  Age     Dept  Salary  Experience
0    101    Alice   25       HR   55000           1
1    102      Bob   30       IT   72000           4
2    103  Charlie   28  Finance   68000           3

In [6]:
df[df['Dept']== 'IT']

   EmpID   Name  Age Dept  Salary  Experience
1    102    Bob   30   IT   72000           4
3    104  David   35   IT   88000           8

In [7]:
df["Salary"].mean()

68600.0

In [8]:
df[df['Salary'] >= 60000]

   EmpID     Name  Age     Dept  Salary  Experience
1    102      Bob   30       IT   72000           4
2    103  Charlie   28  Finance   68000           3
3    104    David   35       IT   88000           8
4    105     Emma   26       HR   60000           2

In [10]:
df['Bonus']= df['Salary']*0.10
print(df)

   EmpID     Name  Age     Dept  Salary  Experience   Bonus
0    101    Alice   25       HR   55000           1  5500.0
1    102      Bob   30       IT   72000           4  7200.0
2    103  Charlie   28  Finance   68000           3  6800.0
3    104    David   35       IT   88000           8  8800.0
4    105     Emma   26       HR   60000           2  6000.0

In [11]:
import numpy as np

In [12]:
np.mean(df['Salary'])

68600.0

In [16]:
min= np.min(df['Salary'])
min

55000